[{"id": 15414, "title": "Momentus increasingly pessimistic about first Vigoride mission", "url": "https://spacenews.com/momentus-increasingly-pessimistic-about-first-vigoride-mission/", "imageUrl": "https://spacenews.com/wp-content/uploads/2022/05/momentus-tug.jpg", "newsSite": "SpaceNews", "summary": "The first orbital transfer vehicle launched by Momentus continues to experience problems and the company says its confidence that the spacecraft can complete its mission has “substantially declined.”", "publishedAt": "2022-06-14T23:22:40.000Z", "updatedAt": "2022-06-14T23:22:40.901Z", "featured": false, "launches": [], "events": []}, {"id": 15413, "title": "Momentus orbital transfer vehicle suffers power problem after launch", "url": "https://spaceflightnow.com/2022/06/14/momentus-orbital-transfer-vehicle-suffers-power-problem-after-launch/", "imageUrl": "https://spaceflightnow.com/wp-content/uploads/2022/05/vigoride1.jpg", "newsSite": "Spaceflight Now", "summary": "The first test flight of a commercial orbital transfer vehicle from Momentus is suffering from a problem with its solar panels after launching last month on a SpaceX rocket, and the company said Monday that its confidence in completing the spacecraft’s demonstrations has “substantially declined.” The Vigoride 3 space tug was one of dozens of small satellites launched on SpaceX’s Transporter 5 rideshare mission May 25. The spacecraft rode a Falcon 9 rocket into a polar orbit from Cape Canaveral, beginning a variety of communications, Earth observation, tech demo, and research missions. Momentus intended to test the Vigoride spacecraft’s novel water-based propulsion system and deploy nine small customer-owned satellites from the transfer vehicle, but power and communications faults are preventing the mission from completing its objectives, the company said Monday. “We are continuing efforts to address the anomalies, but our level of confidence that we will be able to deploy additional customer satellites from Vigoride and perform some planned operations of the vehicle on this test and demonstration mission has substantially declined,” Momentus said Monday.", "publishedAt": "2022-06-14T21:22:19.000Z", "updatedAt": "2022-06-14T21:22:19.130Z", "featured": false, "launches": [], "events": []}, {"id": 15412, "title": "Starlink and OneWeb reach spectrum coordination plan", "url": "https://spacenews.com/starlink-and-oneweb-reach-spectrum-coordination-plan/", "imageUrl": "https://spacenews.com/wp-content/uploads/2020/02/FCC-HQ-_Flickr_k-470x470.jpg", "newsSite": "SpaceNews", "summary": "SpaceX and OneWeb said June 13 they have reached a spectrum coordination plan that would enable their current and second-generation broadband megaconstellations to coexist.", "publishedAt": "2022-06-14T19:32:38.000Z", "updatedAt": "2022-06-14T19:32:38.749Z", "featured": false, "launches": [], "events": []}, {"id": 15411, "title": "Aerospacelab to build “megafactory” in Belgium", "url": "https://spacenews.com/aerospacelab-factory-charleroi/", "imageUrl": "https://spacenews.com/wp-content/uploads/2022/02/rsz_1_aerospacelab_team.jpg", "newsSite": "SpaceNews", "summary": "Belgian startup Aerospacelab announced plans June 14 to establish a new satellite \"megafactory” large enough to produce 500 satellites annually.", "publishedAt": "2022-06-14T18:02:36.000Z", "updatedAt": "2022-06-14T18:02:36.820Z", "featured": false, "launches": [], "events": []}, {"id": 15410, "title": "Lockheed talks OSIRIS-REx success, readiness for APEX mission to Apophis", "url": "https://www.nasaspaceflight.com/2022/06/osiris-rex-update/", "imageUrl": "https://www.nasaspaceflight.com/wp-content/uploads/2018/12/factsheet-artwork-scaled-1170x687.jpg", "newsSite": "NASA Spaceflight", "summary": "The OSIRIS-REx spacecraft is on its way back to Earth after a multi-year, successful mission to the Near-Earth Asteroid (NEA) Bennu. The spacecraft is now bringing a sample of Bennu’s surface back for a drop-off at Earth before continuing with an extended mission.", "publishedAt": "2022-06-14T17:33:21.000Z", "updatedAt": "2022-06-14T17:44:22.045Z", "featured": false, "launches": [{"id": "0bcc6850-4c51-4b08-aa19-0b3753351b9b", "provider": "Launch Library 2"}], "events": []}]